Public Attributes | List of all members
API_BeamSegmentRelation Struct Reference
Element Manager API
Structure for retrieving connection data of a beam segment. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Coord **  | coords
Coordinates of the modified outline polygon.
Int32 **  | pends
Indices of the end coordinates of the subpolygons.
API_PolyArc **  | parcs
Arc segments of the modified outline polygon (used with curved beams.
API_Polygon  | connPoly
Modified outline polygon due to the connections.
GS::Array< API_ConnectionGuidItem > *  | conBeg
List of beam segments connected to the beginning point of the beam segment with their beginning or end point.
GS::Array< API_ConnectionGuidItem > *  | conEnd
List of beam segments connected to the end point of the beam segment with their beginning or end point.
GS::Array< API_ConnectionGuidItem > *  | conRef
List of beam segments connected with their reference line to the beginning or the end point of the beam segment.
GS::Array< API_ConnectionGuidItem > *  | con
List of beam segments connected to the reference line of the beam segment not at the endpoints. +/- values: connection with beginning/end point.
GS::Array< API_ConnectionGuidItem > *  | conX
List of beam segments having intersection with the reference line of the beam segment.
Detailed Description
Structure for retrieving connection data of a beam segment.
Remarks
To learn more about the usage of the beam segment relation structure please refer to the ACAPI_Element_GetRelations function.
Member Data Documentation
◆ con
 API_BeamSegmentRelation::con
List of beam segments connected to the reference line of the beam segment not at the endpoints. +/- values: connection with beginning/end point.
◆ conBeg
 API_BeamSegmentRelation::conBeg
List of beam segments connected to the beginning point of the beam segment with their beginning or end point.
◆ conEnd
 API_BeamSegmentRelation::conEnd
List of beam segments connected to the end point of the beam segment with their beginning or end point.
◆ connPoly
 API_BeamSegmentRelation::connPoly
Modified outline polygon due to the connections.
◆ conRef
 API_BeamSegmentRelation::conRef
List of beam segments connected with their reference line to the beginning or the end point of the beam segment.
◆ conX
 API_BeamSegmentRelation::conX
List of beam segments having intersection with the reference line of the beam segment.
◆ coords
 API_BeamSegmentRelation::coords
Coordinates of the modified outline polygon.
◆ parcs
 API_BeamSegmentRelation::parcs
Arc segments of the modified outline polygon (used with curved beams.
◆ pends
 API_BeamSegmentRelation::pends
Indices of the end coordinates of the subpolygons.